---
kind: type
id: T:Autodesk.Revit.DB.FabricationConfigurationInfo
source: html/c4977168-c9d5-73a7-328c-902330e638c7.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo

Represents an MEP object that holds the properties of an MEP fabrication configuration.

## Syntax (C#)
```csharp
public class FabricationConfigurationInfo : IDisposable
```

## Remarks
To populate the Path property, you may need to call
 FindSourceFabricationConfiguration first.